SELECT[Код_бригады],
                [08:00] = ISNULL((SELECT[Код_заявки] FROM[Бригады_заявки] WHERE[Время] = '08:00' AND[Код_бригады] = [Q].[Код_бригады]),0),
                [09:00] = ISNULL((SELECT[Код_заявки] FROM[Бригады_заявки] WHERE[Время] = '09:00' AND[Код_бригады] = [Q].[Код_бригады]),0),
                [10:00] = ISNULL((SELECT[Код_заявки] FROM[Бригады_заявки] WHERE[Время] = '10:00' AND[Код_бригады] = [Q].[Код_бригады]),0),
                [11:00] = ISNULL((SELECT[Код_заявки] FROM[Бригады_заявки] WHERE[Время] = '11:00' AND[Код_бригады] = [Q].[Код_бригады]),0),
                [12:00] = ISNULL((SELECT[Код_заявки] FROM[Бригады_заявки] WHERE[Время] = '12:00' AND[Код_бригады] = [Q].[Код_бригады]),0),
                [13:00] = ISNULL((SELECT[Код_заявки] FROM[Бригады_заявки] WHERE[Время] = '13:00' AND[Код_бригады] = [Q].[Код_бригады]),0),
                [14:00] = ISNULL((SELECT[Код_заявки] FROM[Бригады_заявки] WHERE[Время] = '14:00' AND[Код_бригады] = [Q].[Код_бригады]),0),
                [15:00] = ISNULL((SELECT[Код_заявки] FROM[Бригады_заявки] WHERE[Время] = '15:00' AND[Код_бригады] = [Q].[Код_бригады]),0),
                [16:00] = ISNULL((SELECT[Код_заявки] FROM[Бригады_заявки] WHERE[Время] = '16:00' AND[Код_бригады] = [Q].[Код_бригады]),0),
                [17:00] = ISNULL((SELECT[Код_заявки] FROM[Бригады_заявки] WHERE[Время] = '17:00' AND[Код_бригады] = [Q].[Код_бригады]),0)
                FROM[Бригады_заявки][Q] GROUP BY[Код_бригады]